#งานที่ 3.4 นางสาวพลอยชมพู  รุ่งพิสิฐไชย 633050135-6

a = []
while True:
    b = input('-----พลอยพิ้งค์ชาบู-----\n[a] เพิ่มข้อมูล\n[s] แสดงข้อมูล\n[x] ออกจากระบบ\nเลือกรายการที่ต้องการ :  ') 
    b = b.lower() #ไม่ว่าจะใส่ตัวพิมพ์ใหญ่หรือเล็กเมื่อเจอน้อนคนนี้ก็จะแปลงเป็นตัวเล็กทั้งหมด ถ้าupper จะเป็นตัวใหญ่
    if b=='a' :
        c = input('ป้อนรายการลูกค้า(โต๊ะที่ : ชื่อ : ออเดอร์)    ')
        a.append(c)
        print('\n***** ข้อมูลได้เข้าสู่ระบบแล้ว *****\n')
    elif b =='s' :
        print('{0:-<6}{0:-<10}{0:-<10}'.format(''))
        print('{0:-<10}{1:-<10}{2:10}'.format('โต๊ะ','ชื่อ','ออเดอร์'))
        print('{0:-<6}{0:-<10}{0:-<10}'.format(''))
        for d in a :
            e = d.split(':')
            print('{0[0]:<6}{0[1]:<10}{0[2]:<10}'.format(e))
            continue
    elif b =='x':
        print('*****ออกจากระบบเรียบร้อยแล้ว*****')
        break
    print('ทำคำสั่งถัดไป')