#งานสัปดาห์ที่ 3 นางสาวพลอยชมพู รุ่งพิสิฐไชย 633050135-6
#งานชิ้นที่ 3.1 นางสาวพลอยชมพู  รุ่งพิสิฐไชย
'''
print('กรุณาเลือกตัวเลือก')
print('กด 1 เลือกเหมาจ่าย')
print('กด 2 เลือกจ่ายเพิ่ม')

a=int(input('Enter your number :'))
b=int(input('Enter your km :'))
if a==1 :
    if b <25 :
        print('ค่าใช้จ่ายรวมทั้งหมด 25 บาท')
    else :
        print('ค่าใช้จ่ายรวมทั้งงหมด 80 บาท')
else :
    if b <25 :
        print('ค่าใช้จ่ายทั้งหมด 25 บาท')
    else :
        print('ค่าใช้จ่ายทั้งหมด 55 บาท')

########################################################

#งานชิ้นที่ 3.2 นางสาวพลอยชมพู  รุ่งพิสิฐไชย
print('กรุณากรอกจำนวนครั้งการรับค่า')
a =int(input('กรอกจำนวนเลข :'))
i = 0
c = 0
while(i<a):
    b =int(input('กรอกตัวเลข :'))
    i +=1
    c = c + b
print('ผลรวมค่าที่รับมาทั้งหมด :'+str(c))

########################################################

#งานชิ้นที่ 3.3 นางสาวพลอยชมพู รุ่งพิสิฐไชย
print('ป้อนชื่ออาหารสุดโปรดของคุณ หรือ exit เพื่อออกจากโปรแกรม')
i = 1
a = 0
food=[]
while(i) :
    a=input('อาหารโปรดอันดับที่ '+str(i)+' คือ  ')
    food.append(a)
    i+=1
    
    if a=='exit' :
        print('อาหารของคุณมีดังนี้')
        print(food)
        break

########################################################

#งานที่ 3.4 นางสาวพลอยชมพู  รุ่งพิสิฐไชย 633050135-6
a = []
while True:
    b = input('-----พลอยพิ้งค์ชาบู-----\n[a] เพิ่มข้อมูล\n[s] แสดงข้อมูล\n[x] ออกจากระบบ\n') 
    b = b.lower() #ไม่ว่าจะใส่ตัวพิมพ์ใหญ่หรือเล็กเมื่อเจอน้อนคนนี้ก็จะแปลงเป็นตัวเล็กทั้งหมด ถ้าupper จะเป็นตัวใหญ่
    if b=='a' :
        c = input('ป้อนรายการลูกค้า(โต๊ะที่:ชื่อ:ออเดอร์)')
        a.append(c)
        print('\n***** ข้อมูลได้เข้าสู่ระบบแล้ว *****\n')
    elif b =='s' :
        print('{0:-<6}{0:-<10}{0:-<10}'.format(''))
        print('{0:-<10}{1:-<10}{2:10}'.format('โต๊ะ','ชื่อ','ออเดอร์'))
        print('{0:-<6}{0:-<10}{0:-<10}'.format(''))
        for d in a :
            e = d.split(':')
            print('{0[0]:<6}{0[1]:<10}{0[2]:<10}'.format(e))
            continue
    elif b =='x':
        break
    print('ทำคำสั่งถัดไป')
    '''